Autodesk.Navisworks.Api.Transform3DComponents
Affine transform represented as individual components that combine to form complete transform. Immutable.

Autodesk.Navisworks.Api.Transform3DComponents.Combine
Combine components together into a composite transform.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Transform3DComponents.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Transform3DComponents.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Transform3DComponents.Rotation
The rotation component of the transform.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'rotation' is null
Throws System.ArgumentException:
Argument 'rotation' has been Disposed

Autodesk.Navisworks.Api.Transform3DComponents.Scale
The scale component of the transform.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'scale' is null
Throws System.ArgumentException:
Argument 'scale' has been Disposed

Autodesk.Navisworks.Api.Transform3DComponents.ScaleOrientation
The scale orientation component of the transform.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'scale_orientation' is null
Throws System.ArgumentException:
Argument 'scale_orientation' has been Disposed

Autodesk.Navisworks.Api.Transform3DComponents.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Transform3DComponents.Translation
The translation component of the transform.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'translation' is null
Throws System.ArgumentException:
Argument 'translation' has been Disposed